pandas panel data
1-d called series
inxex, column
    
2-d data frames

(index + 'n' columns)*(index + 'm' rows)

3-d panel data

In [1]:
import pandas as pd

In [121]:
l=[1,2,3,4,5]
pd.Series(l)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
li={"a":2,"b":4, "c":5,"d":6}
pd.DataFrame([li],index=['none'])

      a  b  c  d
none  2  4  5  6

In [4]:
li={"a":2,"b":4, "c":5,"d":6}
pd.DataFrame([li],index=['values'])

        a  b  c  d
values  2  4  5  6

In [5]:
l=[1,2,3,4,5]
s=[4,5,6,7,8]
d=[4,5]
v=pd.DataFrame(data=[l,s,d])
v

   0  1    2    3    4
0  1  2  3.0  4.0  5.0
1  4  5  6.0  7.0  8.0
2  4  5  NaN  NaN  NaN

In [6]:
l=[1,2,3,4,5]
s=[4,5,6,7,8]
d=[4,5]

v=pd.DataFrame(data=[l,s,d],index=[2,3,4],columns=['ap','ba','or','kc','bk'])
v

   ap  ba   or   kc   bk
2   1   2  3.0  4.0  5.0
3   4   5  6.0  7.0  8.0
4   4   5  NaN  NaN  NaN

In [7]:
l=[1,2,3,4,5]
s=[4,5,6,7,8]
d=[4,5]

v=pd.DataFrame(data=[l,s,d],index=['day1 sold','day2 sold','day3 sold'],columns=['aples','bananas','oranges','kiwis','apricots'])
v

           aples  bananas  oranges  kiwis  apricots
day1 sold      1        2      3.0    4.0       5.0
day2 sold      4        5      6.0    7.0       8.0
day3 sold      4        5      NaN    NaN       NaN

In [8]:
li={"a":2,"b":4, "c":5,"d":6}
pd.DataFrame(data=[li],index=['values'])

        a  b  c  d
values  2  4  5  6

In [50]:
li={"a":2,"b":4, "c":5,"d":6}
li2={"a":2,"b":4, "c":5,"d":6}
temp=pd.DataFrame([li],columns=['a','c','k'])
print(temp)
temp['a']
temp

   a  c   k
0  2  5 NaN

   a  c   k
0  2  5 NaN

In [10]:
li={"a":2,"b":4, "c":5,"d":6, 'k':8}
li2={"a":2,"b":4, "c":5,"d":6,'y':9}
temp=pd.DataFrame([li,li2],index=['li','li2'],columns=['a','c','k','y'])
temp.fillna(0)
temp

     a  c    k    y
li   2  5  8.0  NaN
li2  2  5  NaN  9.0

In [22]:
a=[1,2,3]
b=[3,4,3]
c=[1,2,3]
li={"a":a,"b":b,"c":c}

temp=pd.DataFrame(data=[li['a'],li['b'],li['c']])
temp.fillna(0)
print(temp)
temp[1]

   0  1  2
0  1  2  3
1  3  4  3
2  1  2  3

0    2
1    4
2    2
Name: 1, dtype: int64

In [54]:
l=[1,2,3,4,5]
s=[4,5,6,7,8]
d=[4,5]

v=pd.DataFrame(data=[l,s,d],index=[45,56,37],columns=['ap','ba','or','kc','bk'])
print(v.ap)


print(v.loc[45,'ap'])
print(v.iloc[0])

45    1
56    4
37    4
Name: ap, dtype: int64
1
ap    1.0
ba    2.0
or    3.0
kc    4.0
bk    5.0
Name: 45, dtype: float64

In [58]:
l=[1,2,3,4,5]
s=[4,5,6,7,8]
d=[4,5]

v=pd.DataFrame(data=[l,s,d],index=[45,56,37],columns=['ap','ba','or','kc','bk'])
print(v)


print(v.loc[45])
print(v.iloc[0])

    ap  ba   or   kc   bk
45   1   2  3.0  4.0  5.0
56   4   5  6.0  7.0  8.0
37   4   5  NaN  NaN  NaN
ap    1.0
ba    2.0
or    3.0
kc    4.0
bk    5.0
Name: 45, dtype: float64
ap    1.0
ba    2.0
or    3.0
kc    4.0
bk    5.0
Name: 45, dtype: float64

1

In [68]:
l=[1,2,3,4,5]
s=[4,5,6,7,8]
d=[4,5]

v=pd.DataFrame(data=[l,s,d],index=[45,56,37],columns=['ap','ba','or','kc','bk'])
print(v)



print(v['ap'][45])
print(v[['ap','ba']])
print(v[['ap']])

    ap  ba   or   kc   bk
45   1   2  3.0  4.0  5.0
56   4   5  6.0  7.0  8.0
37   4   5  NaN  NaN  NaN
1
    ap  ba
45   1   2
56   4   5
37   4   5
    ap
45   1
56   4
37   4

In [119]:
weather_data = [('1/1/2017',38,6,'rain'),
                ('1/2/2017',33,7,'sunny'),
                ('1/3/2017',24,2,'rain'),
                ('1/4/2017',22,5,'rain'),
                ('1/5/2017',45,8,'rain'),
                ('1/6/2017',46,7,'rain')]
w = pd.DataFrame(weather_data,columns=['day','temperature','windspeed','event'])
print(w)
print(w.shape)
print(w.head(3))
print(w.tail(2))

        day  temperature  windspeed  event
0  1/1/2017           38          6   rain
1  1/2/2017           33          7  sunny
2  1/3/2017           24          2   rain
3  1/4/2017           22          5   rain
4  1/5/2017           45          8   rain
5  1/6/2017           46          7   rain
(6, 4)
        day  temperature  windspeed  event
0  1/1/2017           38          6   rain
1  1/2/2017           33          7  sunny
2  1/3/2017           24          2   rain
        day  temperature  windspeed event
4  1/5/2017           45          8  rain
5  1/6/2017           46          7  rain

In [87]:
print(w[2:5])

        day  temperature  windspeed event
2  1/3/2017           32          6  rain
3  1/4/2017           32          6  rain
4  1/5/2017           32          6  rain

In [92]:
print(w.columns)

Index([u'day', u'temperature', u'windspeed', u'event'], dtype='object')

In [99]:
print(w.day)
w['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [101]:
w[['day','event']]

        day  event
0  1/1/2017   rain
1  1/2/2017  sunny
2  1/3/2017   rain
3  1/4/2017   rain
4  1/5/2017   rain
5  1/6/2017   rain

In [104]:
w.temperature.max()

35

In [105]:
w.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     32.500000   6.166667
std       1.224745   0.408248
min      32.000000   6.000000
25%      32.000000   6.000000
50%      32.000000   6.000000
75%      32.000000   6.000000
max      35.000000   7.000000

In [107]:
w['temperature'].describe()

count     6.000000
mean     32.500000
std       1.224745
min      32.000000
25%      32.000000
50%      32.000000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [108]:
w[w.temperature == w.temperature.max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  sunny

In [111]:
w[w.temperature == w.temperature.align]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [112]:
w.day[w.temperature == w.temperature.max()]

1    1/2/2017
Name: day, dtype: object

In [113]:
w[['day','event']][w.temperature == w.temperature.max()]

        day  event
1  1/2/2017  sunny

In [120]:
print(w)
w[['day','event']][w.temperature == w.temperature.min()]

        day  temperature  windspeed  event
0  1/1/2017           38          6   rain
1  1/2/2017           33          7  sunny
2  1/3/2017           24          2   rain
3  1/4/2017           22          5   rain
4  1/5/2017           45          8   rain
5  1/6/2017           46          7   rain

        day event
3  1/4/2017  rain